In [32]:
import os
import pandas as pd

In [3]:
df = pd.read_csv("Day_2_Stock_Data/All_Stocks_Data.csv")

In [7]:
df.head()

,Date,Open,High,Low,Close,Volume,Symbol,Asset_Type,Name
0,2024-01-16,22080.500000,22124.150391,21969.800781,22032.300781,292400,^NSEI,Index,NIFTY_50
1,2024-01-17,21647.250000,21851.500000,21550.449219,21571.949219,456000,^NSEI,Index,NIFTY_50
2,2024-01-18,21414.199219,21539.400391,21285.550781,21462.250000,387300,^NSEI,Index,NIFTY_50
3,2024-01-19,21615.199219,21670.599609,21575.000000,21622.400391,343100,^NSEI,Index,NIFTY_50
4,2024-01-23,21716.699219,21750.250000,21192.599609,21238.800781,449700,^NSEI,Index,NIFTY_50

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2472 entries, 0 to 2471
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        2472 non-null   object
 1   Open        2472 non-null   float64
 2   High        2472 non-null   float64
 3   Low         2472 non-null   float64
 4   Close       2472 non-null   float64
 5   Volume      2472 non-null   int64
 6   Symbol      2472 non-null   object
 7   Asset_type  2472 non-null   object
 8   Name        2472 non-null   object
dtypes: float64(4), int64(1), object(4)
memory usage: 173.9+ KB

In [6]:
df.columns = [col.strip().title().replace(" ", "_") for col in df.columns]

In [8]:
df['Date'] = pd.to_datetime(df['Date'], format='%Y-%m-%d')

In [11]:
df.sort_values(by=['Date', 'Symbol'], inplace=True)

In [12]:
df.head()

,Date,Open,High,Low,Close,Volume,Symbol,Asset_Type,Name
1976,2024-01-16,814.225255,819.408470,806.973625,817.218384,25322500,HDFCBANK.NS,Stock,HDFCBANK
984,2024-01-16,1379.762711,1386.041313,1360.430819,1364.525513,9069024,RELIANCE.NS,Stock,RELIANCE
1480,2024-01-16,3697.237856,3697.237856,3656.036316,3661.488770,1432672,TCS.NS,Stock,TCS
494,2024-01-16,48109.949219,48305.398438,48002.851562,48125.101562,224500,^NSEBANK,Index,BANK_NIFTY
0,2024-01-16,22080.500000,22124.150391,21969.800781,22032.300781,292400,^NSEI,Index,NIFTY_50

In [13]:
df.isna().sum()

Date          0
Open          0
High          0
Low           0
Close         0
Volume        0
Symbol        0
Asset_Type    0
Name          0
dtype: int64

In [14]:
df.duplicated().sum()

np.int64(0)

In [16]:
invalid_High = df[
    (df['High'] < df['Low']) |
    (df['High'] < df['Open']) |
    (df['High'] < df['Close'])
]
invalid_High.shape

(0, 9)

In [19]:
invalid_Low = df[
    (df["Low"] > df["High"]) |
    (df["Low"] > df["Open"]) |
    (df["Low"] > df["Close"])
]
invalid_Low.shape

(0, 9)

In [20]:
invalid_Low.empty & invalid_High.empty

True

In [21]:
df = df[df["Volume"]>= 0]

In [26]:
df.reset_index(drop=True, inplace=True)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2472 entries, 0 to 2471
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        2472 non-null   datetime64[ns]
 1   Open        2472 non-null   float64
 2   High        2472 non-null   float64
 3   Low         2472 non-null   float64
 4   Close       2472 non-null   float64
 5   Volume      2472 non-null   int64
 6   Symbol      2472 non-null   object
 7   Asset_Type  2472 non-null   object
 8   Name        2472 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(1), object(3)
memory usage: 173.9+ KB

In [28]:
df.describe()

,Date,Open,High,Low,Close,Volume
count,2472,2472.000000,2472.000000,2472.000000,2472.000000,2.472000e+03
mean,2025-01-17 16:16:53.592232960,16408.752199,16500.137423,16315.294331,16408.498917,9.335675e+06
min,2024-01-16 00:00:00,669.679568,677.223197,663.620355,673.597412,0.000000e+00
25%,2024-07-22 00:00:00,1332.054866,1339.439381,1316.815712,1333.293701,2.743000e+05
50%,2025-01-17 00:00:00,3679.481921,3702.848287,3646.633757,3670.450317,2.246856e+06
75%,2025-07-18 00:00:00,25068.687988,25145.912109,24965.187988,25053.487305,1.297289e+07
max,2026-01-14 00:00:00,60360.398438,60437.351562,59859.800781,60150.949219,4.453421e+08
std,NaN,19989.164815,20097.160083,19881.771040,19991.929072,1.908095e+07

In [29]:
df.head()

,Date,Open,High,Low,Close,Volume,Symbol,Asset_Type,Name
0,2024-01-16,814.225255,819.408470,806.973625,817.218384,25322500,HDFCBANK.NS,Stock,HDFCBANK
1,2024-01-16,1379.762711,1386.041313,1360.430819,1364.525513,9069024,RELIANCE.NS,Stock,RELIANCE
2,2024-01-16,3697.237856,3697.237856,3656.036316,3661.488770,1432672,TCS.NS,Stock,TCS
3,2024-01-16,48109.949219,48305.398438,48002.851562,48125.101562,224500,^NSEBANK,Index,BANK_NIFTY
4,2024-01-16,22080.500000,22124.150391,21969.800781,22032.300781,292400,^NSEI,Index,NIFTY_50

In [33]:
cleaned_data = os.makedirs("Day_4_Cleaned_Data", exist_ok=True)

In [34]:
df.to_csv("Day_4_Cleaned_Data/Cleaned_Stock_Data.csv", index=False)

In [35]:
df2 = pd.read_csv("Day_3_Crypto_Forex_Data/All_Crypto_Forex_Data.csv")

In [36]:
df2.head()

,Date,Open,High,Low,Close,Volume,Symbol,Asset_Type
0,2024-01-16,42499.335938,43566.273438,42085.996094,43154.945312,24062872740,BTC-USD,crypto
1,2024-01-17,43132.101562,43189.890625,42189.308594,42742.652344,20851232595,BTC-USD,crypto
2,2024-01-18,42742.312500,42876.347656,40631.171875,41262.058594,25218357242,BTC-USD,crypto
3,2024-01-19,41278.460938,42134.160156,40297.457031,41618.406250,25752407154,BTC-USD,crypto
4,2024-01-20,41624.589844,41877.894531,41446.824219,41665.585938,11586690904,BTC-USD,crypto

In [42]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2498 entries, 0 to 2497
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        2498 non-null   datetime64[ns]
 1   Open        2498 non-null   float64
 2   High        2498 non-null   float64
 3   Low         2498 non-null   float64
 4   Close       2498 non-null   float64
 5   Volume      2498 non-null   int64
 6   Symbol      2498 non-null   object
 7   Asset_Type  2498 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(1), object(2)
memory usage: 156.3+ KB

In [41]:
df2['Date'] = pd.to_datetime(df2['Date'], format='%Y-%m-%d')

In [43]:
df2.sort_values(by=['Date', 'Symbol'], inplace=True)

In [45]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2498 entries, 0 to 2497
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        2498 non-null   datetime64[ns]
 1   Open        2498 non-null   float64
 2   High        2498 non-null   float64
 3   Low         2498 non-null   float64
 4   Close       2498 non-null   float64
 5   Volume      2498 non-null   int64
 6   Symbol      2498 non-null   object
 7   Asset_Type  2498 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(1), object(2)
memory usage: 175.6+ KB

In [48]:
df2.isna().sum()

Date          0
Open          0
High          0
Low           0
Close         0
Volume        0
Symbol        0
Asset_Type    0
dtype: int64

In [49]:
df2.duplicated().sum()

np.int64(0)

In [52]:
df2.to_csv("Day_4_Cleaned_Data/Cleaned_Crypto_Forex_Data.csv", index=False , header=True)